export const results = {
	istj: {
		adj: {
			kr: "한번 맡은 임무는 끝까지 완수하는",
		},
		job: {
			kr: "논리주의자",
		},
		name: {
			kr: "호크아이",
		},
		image_url: "../assets/hawk_eye.jpeg",
		description: {
			kr:
				"당신은 가정 뿐 아니라 기관 혹은 군대와 같이 전통이나 질서를 중시하는 조직에서 핵심 구성원 역할을 합니다. 당신은 자신이 맡은 바 책임을 다 하며 하는 일에 자부심을 가지고 있습니다. 또한 목표를 달성하기 위해 시간과 에너지를 허투루 쓰지 않으며, 이에 필요한 업무를 정확하고 신중하게 처리합니다. 우유부단한 것을 몹시 싫어하며 결정 내린 실행안이 비현실적인 이유로 장애에 부딪혔을 때 쉬이 인내심을 잃고 불편한 심기를 얼굴에 그대로 나타내기도 합니다. 책임감과 열정이 강해 나태하고 부도덕한 사람들과 맞지 않으며 목표 달성에 도움이 안되는 무리와 협력하는 것보단 차라리 혼자 일하는 것을 선호합니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	isfj: {
		adj: {
			kr: "온화하며 성실하고 협조적인",
		},
		job: {
			kr: "수호자",
		},
		name: {
			kr: "캡틴 아메리카",
		},
		image_url: "./assets/captain_america.jpg",
		description: {
			kr:
				"당신은 타인을 향한 연민이나 동정심이 있으면서도 가족이나 친구를 보호해야 할 때는 가차 없는 모습을 보이기도 합니다. 조용하고 내성적인 반면 관계술에 뛰어나 인간관계를 잘 만들어갑니다. 안정적인 삶을 지향하지만 이들이 이해받고 존경받는다고 생각되는 한에서는 변화를 잘 수용합니다. 당신은 맡은 바 일에 책임감을 가지고 업무에 임하며, 회사나 가정에서 자신의 기대치를 넘어 주위 사람들을 만족시키고자 최선을 다합니다. 누군가가 자신을 필요로 할 때 행복을 느끼며 비판과 비난에 약한 모습을 보입니다. 당신은 종종 자신이 이룬 성취를 과소평가하는 경향이 있는데, 이러한 겸손한 태도로 종종 다른 이들로부터 존경을 받기도 하는가 하면, 이기적이고 냉소적인 사람들은 당신의 겸손함을 역으로 이용하여 당신이 세운 공을 자신의 것으로 돌리는 경우도 있습니다. ",
		},
		good_relation: [],
		bad_relation: [],
	},
	infj: {
		adj: {
			kr: "뛰어난 통찰력과 이타심을 가진",
		},
		job: {
			kr: "옹호자",
		},
		name: {
			kr: "비전",
		},
		image_url: "./assets/vision.jpg",
		description: {
			kr:
				"이상이나 도덕적 관념이 깊이 자리하고 있으며 단호함과 결단력이 있습니다. 바라는 이상을 꿈꾸는데 절대 게으름 피우는 법이 없으며, 목적을 달성하고 지속적으로 긍정적인 영향을 미치고자 구체적으로 계획을 세워 이행해 나갑니다. 당신은 고유한 성향을 내포하고 있습니다. 나긋나긋한 목소리 뒤에는 강직함이 숨어 있으며, 의견을 강력하게 피력할 줄 알며 옳다고 생각되는 일에는 지칠 줄 모르고 투쟁합니다. 강한 의지와 분별력이 있고 자신의 장점을 이용해 자신이 꿈꾸는 이상적인 세상을 만들고자 합니다. 당신은 또한 타인과 스스럼없이 잘 어울리며, 대화 시 단순한 논리나 사실에 입각한 딱딱한 대화가 아닌 따뜻하고 섬세한 언어를 사용하여 인간 대 인간으로 이야기를 나눕니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	intj: {
		adj: {
			kr: "넓은 시야와 사고를 지닌",
		},
		job: {
			kr: "전략가",
		},
		name: {
			kr: "닥터 스트레인지",
		},
		image_url: "./assets/doctor_strange.jpg",
		description: {
			kr:
				"체스를 두는 듯한 정확하고 계산된 움직임과 풍부한 지식을 소유하고 있는 당신은 본인과 견줄 만한 비슷한 부류의 사람을 찾는 데 종종 어려움을 겪습니다. 당신은 상상력이 풍부하면서도 결단력이 있으며, 야망이 있지만 대외적으로 표현하지 않으며, 놀랄 만큼 호기심이 많지만 쓸데없는 데 에너지를 낭비하는 법이 없습니다. 당신의 지식을 향한 갈증은 어릴 적부터 두드러지게 나타나며, 깊고 넓은 지식을 가지고 있는 것에 대해 남다른 자부심을 느낍니다. 가십거리나 별 볼 일 없는 주제로 잡담하는 것 보다는 특정 분야에 대해 토론하고 다른 이들에게 공유 하는 것을 원합니다. 지적이고 확신에 찬 자신감이 넘치지만 인간관계만큼은 쉽지 않습니다. 진리나 깊이 있는 지식을 좇는 당신에게 선의의 거짓말이나 가벼운 잡담은 그저 낯설기만 합니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	istp: {
		adj: {
			kr: "적응력이 뛰어나고 상황판단이 빠른",
		},
		job: {
			kr: "만능 재주꾼",
		},
		name: {
			kr: "블랙 위도우",
		},
		image_url: "./assets/black_widow.jpg",
		description: {
			kr:
				"냉철한 이성주의적 성향과 왕성한 호기심을 가진 당신은 직접 손으로 만지고 눈으로 보면서 주변 세상을 탐색하는 것을 좋아합니다 실생활에 유용하면서도 자질구레한 것들을 취미삼아 만드는 것을 좋아하는데, 그러면서 새로운 기술을 하나하나 터득해 나갑니다. 당신은 독립적이지만, 타인을 잘 도우며 자신의 경험을 다른 이들과 공유하는 것을 좋아하며 특히나 자신이 아끼는 사람일수록 더욱 그러합니다. 내성적인 성향으로 현실적인 사안에 관심이 많은 당신은 얼핏 보면 단순해 보일 수 있지만, 사실 알고 보면 꽤 복잡한 성향을 가지고 있습니다. 친절하고 상냥하지만 사생활을 중요시 여기며, 침착하면서도 금세 즉흥적인 성향으로 돌변하기도 하며, 호기심이 많으면서도 오래 앉아 수업을 들을 때는 집중하지 못하는 모습을 보이기도 합니다. 이로 인해 주변 사람들에게서 변덕스럽다는 말을 듣기도 합니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	isfp: {
		adj: {
			kr: "따뜻한 감성과 겸손을 지닌",
		},
		job: {
			kr: "예술가",
		},
		name: {
			kr: "블랙 팬서",
		},
		image_url: "./assets/black_panther.jpg",
		description: {
			kr:
				"당신은 예술적 감각이 발달했으며 자유롭고 모험적인 편입니다. 당신은 다양한 아이디어나 사람들로부터 영감을 받아 다채로우면서도 감각적인 삶을 살아갑니다. 당신이 받은 영감을 본인만의 시각으로 재해석하여 새로운 것을 발견하고 탐험함으로써 즐거움을 느끼기도 하는 당신은 그 어떤 유형의 사람보다 탐험이나 실험 정신이 뛰어납니다. 당신은 타인의 감정을 잘 살피며 조화를 중요시 여깁니다. 불편한 관계가 지속되는 동안 기다리는 것은 힘든 일이지만, 한번 관계가 회복되고 나면 과거는 과거일 뿐이라고 생각하며 마치 아무 일도 없었다는 듯이 다시금 원래의 삶을 살아갑니다. 하지만 때론 이로 인해 자신에게 소중한 사람들을 잘 알아보지 못하거나 좋은사람과 나쁜사람을 잘 구별하지 못 합니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	infp: {
		adj: {
			kr: "이상적인 세계를 만들어가는",
		},
		job: {
			kr: "중재자",
		},
		name: {
			kr: "스칼렛 위치",
		},
		image_url: "./assets/scarlet_witch.png",
		description: {
			kr:
				"당신은 최악의 상황이나 악한 사람에게서도 좋은 면만을 바라보며 긍정적이고 더 나은 상황을 만들고자 노력하는 진정한 이상주의자입니다. 자신만의 선과 악의 구분이 명확하게 있으며 논리나 인생의 실용적인 부분이 아니라 자기 자신 나름의 원리원칙에 근거하여 사고하고 행동합니다. 타인의 감정을 잘 읽고 모든 유형중에 자신의 감정도 가장 정확하게 이해하는 유형입니다, 하지만 그만큼 타인의 무감각함에 더 상처를 받습니다. 쉽게 지루함을 느끼고 산만해지는 편이며 시간내에 목표를 완수하지 못 할 때가 많습니다. 가끔 이상적인 삶에 대한 공상이 있기도 하지만, 사실적 논리나 현실적인 유용성의 관점이 아닌 넘치는 영감과 인간애, 친절함, 그리고 따뜻한 마음으로 세상을 바라봅니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	intp: {
		adj: {
			kr: "뛰어난 두뇌의 소유자이며 비평적인 관점을 가진",
		},
		job: {
			kr: "사색가",
		},
		name: {
			kr: "브루스 배너",
		},
		image_url: "./assets/bruce_banner.jpg",
		description: {
			kr:
				"당신은 '평범함'을 거부합니다. 당신은 당신이 가진 독창성과 창의력, 그리고 독특한 관점과 왕성한 지적 호기심에 나름의 자부심을 가지고 있습니다. 어떠한 업무를 맡았을 때, 당신보다 문제를 정확히 파악하고 이를 둘러싸고 있는 요소를 낱낱이 파헤쳐 독창적이며 실행 가능한 해결책을 찾아내는 데 더 열성적이고 뛰어난 사람은 없습니다. 하지만 당신은 업무 진행 상황에 따른 보고서 따위를 제출하는 것은 질색합니다. 당신은 한시도 쉼없이 생각에 몰두하고 새로운 아이디어를 쏟아냅니다. 때론 현실성없는 공상이고 행동력이 부족해 실행에 옮기지 못 하지만 자신이 관심있는 분야에 대해선 전문가이며 달변가입니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	estp: {
		adj: {
			kr: "활동적이며 모험을 즐기는",
		},
		job: {
			kr: "사업가",
		},
		name: {
			kr: "스타로드",
		},
		image_url: "./assets/starlord.jpg",
		description: {
			kr:
				'당신은 항상 에너지가 넘치며 쾌활한 성격을 지녔으며, 직설적이면서도 친근한 농담으로 주변 사람들을 웃게 만들어 주변의 이목을 끄는 것을 좋아합니다. 행동이 먼저 앞서나가서 가끔 실수를 범하기도 하지만 당신은 단순히 턱 괴고 앉아 지켜만 보고 있느니 만약의 사태를 대비해 만반의 준비를 한 뒤라면 직접 나가 몸으로 부딪혀 문제를 해결해 나가는 것을 선호합니다. 당신은 관습을 무시하는 경향이 있으며 "규칙은 깨라고 있는 법!" 이라고 생각합니다. 눈치가 빠르며 타인의 사소한 변화도 쉽게 캐치해내지만 타인의 감정을 많이 고려하지 않은 채 이것저것 물어보고 싶어해 자칫 잘못하면 예민한 사람의 감정에 상처를 입힐 수도 있습니다.',
		},
		good_relation: [],
		bad_relation: [],
	},
	esfp: {
		adj: {
			kr: "긍정적으로 인생을 즐기며 사는",
		},
		job: {
			kr: "연예인",
		},
		name: {
			kr: "토르",
		},
		image_url: "./assets/thor.jpg",
		description: {
			kr:
				"당신은 천부적인 스타성 기질을 타고 났으며 자신에게 쏟아지는 스포트라이트를 즐깁니다. 매사에 열정적이며 의리를 중요시하고 정이 많기 때문에 주위 사람들에게서 털털하다는 소리도 듣습니다. 인생의 문제에 직면 했을때 해결하려 하기 보다는 문제 자체를 피하고 싶어 합니다. 단체 생활과 사람들과 어울리는 시간보다 큰 즐거움은 없다고 생각합니다. 하지만 다소 다혈질 기질이 있고 화려한 걸 좋아해서 가끔 지나친 소비를 하는 편입니다. 조금은 즉흥적이고 제멋대로이지만 항상 긍정적으로 본인의 인생을 즐깁니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	enfp: {
		adj: {
			kr: "열정적이며 재기발랄한",
		},
		job: {
			kr: "활동가",
		},
		name: {
			kr: "스파이더맨",
		},
		image_url: "./assets/spiderman.jpg",
		description: {
			kr:
				"당신은 자유로운 사고의 소유자입니다. 종종 분위기 메이커 역할을 하기도 하는 당신은 단순한 인생의 즐거움이나 그때그때 상황에서 주는 일시적인 만족이 아닌 타인과 사회적, 정서적으로 깊은 유대 관계를 맺음으로써 행복을 느낍니다. 뛰어난 통찰력을 지녔고 사람 관계를 잘 조율해 인맥도 넓지만 의외로 독립적인 활동을 좋아합니다. 창조적인 도전을 즐기며 반복되는 일을 싫어합니다. 겉으로 쉽게 보이진 않지만 의외로 감수성이 짙고 섬세하고 민감해 마음의 상처가 많은 편입니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	entp: {
		adj: {
			kr: "풍부한 상상력으로 항상 도전하는",
		},
		job: {
			kr: "변론가",
		},
		name: {
			kr: "아이언맨",
		},
		image_url: "./assets/ironman.jpg",
		description: {
			kr:
				"당신은 상상력이 풍부하며 두뇌회전이 빠르고 임기응변이 뛰어납니다. 타인이 믿는 이념이나 논쟁에 반향을 일으킴으로써 군중을 선동하는 일명 선의의 비판자로써 반항심이 강하고 고집이 셉니다. 목적을 가장 중요시하고 추진력이 뛰어난 만큼 일 중독에 빠지기 쉽고 많은 지식에 대한 갈망이 있습니다. 천부적으로 재치 있는 입담과 풍부한 지식 그리고 뛰어난 목적 달성으로 주위에 아군도 많지만 가끔 굽힐 줄 모르는 지나친 솔직함과 눈치 보지 않는 성향 탓에 적도 많이 만드는 유형입니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	estj: {
		adj: {
			kr: "실용성을 중시하는 엄격한",
		},
		job: {
			kr: "관리자",
		},
		name: {
			kr: "타노스",
		},
		image_url: "./assets/thanos.jpg",
		description: {
			kr:
				"당신은 사회나 가족을 하나로 단결 시키고 필요한 질서를 정립하는데 이바지하는 대표적인 유형입니다. 법과 사회 질서의 중요함을 굳게 믿으며 헌신과 공명정대한 삶을 통해 다른 이들에게 본보기가 되고자 합니다. 특히 업무적으로 게으르거나 부정을 저지르는 자들은 가차 없이 벌하기도 합니다. 목적을 달성하려는 의지가 강하며 추진함에 있어 게으름이란 없습니다. 자신의 방법을 고집해 한번 시작한 일은 끝을 보려 합니다. 때론 지나친 자신감으로 인해 타인의 의견을 묵살하는 경향도 있습니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	esfj: {
		adj: {
			kr: "봉사 정신이 투철한",
		},
		job: {
			kr: "외교관",
		},
		name: {
			kr: "앤트맨",
		},
		image_url: "./assets/antman.jpg",
		description: {
			kr:
				"타인과의 관계를 우선시하고 갈등을 매우 싫어합니다. 사교를 중요시 하기 때문에 우정을 소중히 여기며 유순하고 헌신적인 편입니다. 하지만 그로 인해 외로움을 많이 타고 타인의 의견을 중시하는 경향이 있습니다. 때론 타인에 대한 의존성이 강해 지나친 헌신으로 본인이 상처를 입을 때도 있습니다. 당신은 타인에 대한 지원을 아끼지 않는 활발한 성격의 소유자로써 어떻게든 의미 있는 방식으로 다른 이에게 도움이 되고자 합니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	enfj: {
		adj: {
			kr: "언변에 능숙한",
		},
		job: {
			kr: "사회 운동가",
		},
		name: {
			kr: "로키",
		},
		image_url: "./assets/loki.jpg",
		description: {
			kr:
				"타고난 달변가이며 재치있게 말을 잘 하고 유머러스하며 타인을 잘 다루는 유형입니다. 타인에 대한 공감능력이 뛰어나고 타인의 감정변화에 민감하여 타인을 쉽게 편하게 만들어 줄 수 있습니다. 홀로 있는 것을 힘들어하며 모든 이에게 사랑받길 원하고 비난을 잘 받아들이지 못 합니다. 자신만의 강한 신념과 이상을 지니고 있으며 자신이 남들을 이해해주듯 남들도 자신과 같은 생각과 사상을 가지길 원합니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
	entj: {
		adj: {
			kr: "비전있고 리더쉽을 가진",
		},
		job: {
			kr: "통솔자",
		},
		name: {
			kr: "닉 퓨리",
		},
		image_url: "./assets/nick_fury.jpg",
		description: {
			kr:
				"당신은 강력하고 카리스마 있는 지도력을 가지고 있습니다. 높은 야망이 있고 목표를 위해선 수단과 방법을 가리지 않고 냉정하게 가끔은 무모하리만치 이성적인 판단을 내리는 편입니다. 조직의 앞날을 계획하고 최우선시 하며 방해되는 모든 것을 제거합니다. 타인의 감정표현이 불편하며 때론 타인의 의견을 무시하기도 하고 조직에 불필요하면 버리기도 하는 냉정한 성격입니다. 하지만 전략적이고 논리적인 사고와 빠른 판단력과 정확성으로 계획을 단계별로 실행해 나가는 진정한 리더입니다.",
		},
		good_relation: [],
		bad_relation: [],
	},
};
